recipes/vegetable-barley-soup.org
#+TITLE: Vegetable Barley Soup
#+DATE: 2020-09-05
#+SETUPFILE: recipe.setup

[[https://hellolittlehome.com/vegetable-barley-soup-vegetarian/][Original link]]

* Ingredients
- 1 tbsp extra virgin olive oil
- 1 medium onion, diced
- 2 carrots, thinly sliced
- 1 large stalk celery, thinly sliced
- 8 oz mushrooms, sliced
- 2 cloves garlic, minced
- 8 cups vegetable broth
- 1 can chickpeas, drained and rinsed
- 1 can diced tomatoes
- 1 1/2 cups frozen cut green beans
- 1 cup pearl barley
- 2/3 cup frozen corn
- 1 tsp dried basil
- 1/2 tsp dried oregano
- 1 bay leaf
- 2/3 cup frozen peas
- 1/3 cup chopped Italian parsley leaves, plus extra for serving
- salt
- pepper

* Instructions
- Heat olive oil in a large pot over medium heat.
- Add onions, carrots, and celery to oil; season with salt and pepper.
- Saute veggies until softened, about 5 minutes.
- Increase heat to medium-high; then add mushrooms and cook until lightly browned, stirring frequently.
- Stir in garlic and cook, stirring constantly, until fragrant (about 30 seconds).
- Add broth, chickpeas, tomatoes, green beans, barley, corn, basil, oregano, and bay leaf.
- Bring soup to a boil, then reduce to a simmer.
- Cook soup until barley is tender, stirring occasionally, about 30 minutes.
- Mix in peas and cook until tender and hot, about 1 to 2 minutes.
- Remove soup from heat and discard bay leaf. Stir in parsley and season to taste with salt and pepper.
- Serve soup hot, sprinkled with additional parsley. Enjoy!
