recipes/vegetable-barley-soup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Vegetable Barley Soup</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Vegetable Barley Soup</h1>
<p>
<a href="https://hellolittlehome.com/vegetable-barley-soup-vegetarian/">Original link</a>
</p>

<div id="outline-container-org67e74d0" class="outline-2">
<h2 id="org67e74d0">Ingredients</h2>
<div class="outline-text-2" id="text-org67e74d0">
<ul class="org-ul">
<li>1 tbsp extra virgin olive oil</li>
<li>1 medium onion, diced</li>
<li>2 carrots, thinly sliced</li>
<li>1 large stalk celery, thinly sliced</li>
<li>8 oz mushrooms, sliced</li>
<li>2 cloves garlic, minced</li>
<li>8 cups vegetable broth</li>
<li>1 can chickpeas, drained and rinsed</li>
<li>1 can diced tomatoes</li>
<li>1 1/2 cups frozen cut green beans</li>
<li>1 cup pearl barley</li>
<li>2/3 cup frozen corn</li>
<li>1 tsp dried basil</li>
<li>1/2 tsp dried oregano</li>
<li>1 bay leaf</li>
<li>2/3 cup frozen peas</li>
<li>1/3 cup chopped Italian parsley leaves, plus extra for serving</li>
<li>salt</li>
<li>pepper</li>
</ul>
</div>
</div>

<div id="outline-container-org337730a" class="outline-2">
<h2 id="org337730a">Method</h2>
<div class="outline-text-2" id="text-org337730a">
<ul class="org-ul">
<li>Heat olive oil in a large pot over medium heat.</li>
<li>Add onions, carrots, and celery to oil; season with salt and pepper.</li>
<li>Saute veggies until softened, about 5 minutes.</li>
<li>Increase heat to medium-high; then add mushrooms and cook until lightly browned, stirring frequently.</li>
<li>Stir in garlic and cook, stirring constantly, until fragrant (about 30 seconds).</li>
<li>Add broth, chickpeas, tomatoes, green beans, barley, corn, basil, oregano, and bay leaf.</li>
<li>Bring soup to a boil, then reduce to a simmer.</li>
<li>Cook soup until barley is tender, stirring occasionally, about 30 minutes.</li>
<li>Mix in peas and cook until tender and hot, about 1 to 2 minutes.</li>
<li>Remove soup from heat and discard bay leaf. Stir in parsley and season to taste with salt and pepper.</li>
<li>Serve soup hot, sprinkled with additional parsley. Enjoy!</li>
</ul>
</div>
</div>
</div>
</body>
</html>
